Table of Contents
 Interface IIdeaArcSegment3D
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represents the line segment of the element.
 Line segment is defined by three points returned by the StartNode, EndNode of the base class IIdeaSegment3D and ArcPoint.
public interface IIdeaArcSegment3D : IIdeaSegment3D, IIdeaObject
Inherited Members
 IIdeaSegment3D.StartNode
 IIdeaSegment3D.EndNode
 IIdeaSegment3D.LocalCoordinateSystem
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 ArcPoint
Third point that defines the arc. Must not be equal to StartNode or EndNode
IIdeaNode ArcPoint { get; }
Property Value
IIdeaNode
 Edit this page